{
    "nav": {
        "home": "Inicio",
        "microservices": "Microservicios",
        "springBoot": "Spring Boot",
        "dockerK8s": "Docker y K8s",
        "databases": "Bases de Datos",
        "fedora": "Fedora OS"
    },
    "home": {
        "welcome": "Bienvenido a",
        "subtitle": "Tu viaje interactivo al mundo de la ingeniería de software moderna.",
        "cards": {
            "microservices": "Desacopla tu arquitectura.",
            "cloudNative": "Dominio de Docker y Kubernetes.",
            "modernData": "Paradigmas SQL y NoSQL."
        }
    },
    "microservices": {
        "title": "Arquitectura de Microservicios",
        "subtitle": "Desacoplando aplicaciones en servicios pequeños e independientes.",
        "whatIs": {
            "title": "¿Qué son los Microservicios?",
            "content": "La arquitectura de microservicios es un enfoque para desarrollar una aplicación única como un conjunto de pequeños servicios, cada uno ejecutándose en su propio proceso y comunicándose con mecanismos ligeros, a menudo una API de recursos HTTP."
        },
        "features": {
            "deployable": "Desplegables independientemente",
            "maintainable": "Altamente mantenibles y testeables",
            "organized": "Organizados en torno a capacidades de negocio"
        },
        "monolith": {
            "title": "Monolito vs Microservicios",
            "monolithLabel": "Monolito",
            "serviceLabel": "Servicio"
        },
        "characteristics": {
            "title": "Características Clave",
            "decentralized": {
                "title": "Datos Descentralizados",
                "content": "Cada servicio gestiona su propia base de datos, asegurando un acoplamiento débil pero requiriendo patrones de consistencia eventual."
            },
            "smartEndpoints": {
                "title": "Endpoints Inteligentes",
                "content": "Los servicios se comunican a través de APIs REST simples o colas de mensajería (RabbitMQ, Kafka), manteniendo la lógica en los servicios, no en las tuberías."
            },
            "automated": {
                "title": "Despliegue Automatizado",
                "content": "Requiere pipelines de CI/CD robustos para gestionar la complejidad de desplegar múltiples servicios."
            }
        },
        "patterns": {
            "title": "Patrones Avanzados",
            "gateway": {
                "title": "API Gateway",
                "content": "Un servidor que es el único punto de entrada al sistema. Encapsula la arquitectura interna del sistema y proporciona una API adaptada a cada cliente."
            },
            "circuitBreaker": {
                "title": "Circuit Breaker",
                "content": "Evita que una aplicación intente repetidamente ejecutar una operación que es probable que falle. Esencial para la resiliencia en sistemas distribuidos."
            },
            "discovery": {
                "title": "Descubrimiento de Servicios",
                "content": "Detección automática de dispositivos y servicios ofrecidos por estos dispositivos en una red informática. Herramientas como Eureka o Consul son comúnmente usadas."
            }
        }
    },
    "springBoot": {
        "title": "Java Spring Boot",
        "subtitle": "Aplicaciones Spring listas para producción.",
        "features": {
            "opinionated": {
                "title": "Opinado",
                "content": "Adopta una visión opinada de la plataforma Spring y bibliotecas de terceros para que puedas empezar con el mínimo esfuerzo."
            },
            "standalone": {
                "title": "Autónomo",
                "content": "Crea aplicaciones Spring independientes que puedes ejecutar directamente (Tomcat, Jetty o Undertow integrados)."
            },
            "production": {
                "title": "Listo para Producción",
                "content": "Proporciona características listas para producción como métricas, comprobaciones de salud y configuración externalizada."
            }
        },
        "quickStart": {
            "title": "Inicio Rápido",
            "desc": "Un controlador REST simple en Spring Boot."
        },
        "entryPoint": {
            "title": "El Punto de Entrada",
            "desc": "Arrancar la aplicación es tan simple como anotar una clase."
        },
        "deepDive": {
            "title": "Profundización",
            "di": {
                "title": "Inyección de Dependencias",
                "content": "La característica central de Spring. Te permite desacoplar la creación de objetos de su uso."
            },
            "jpa": {
                "title": "Spring Data JPA",
                "content": "Facilita la implementación de repositorios basados en JPA. Reduce el código repetitivo necesario para acceder a los datos."
            },
            "security": {
                "title": "Spring Security",
                "content": "Un marco de autenticación y control de acceso potente y altamente personalizable."
            }
        }
    },
    "dockerK8s": {
        "title": "Docker y Kubernetes",
        "subtitle": "Contenedorización y Orquestación para aplicaciones modernas.",
        "docker": {
            "title": "Docker",
            "content": "Docker empaqueta el software en unidades estandarizadas llamadas contenedores que tienen todo lo que el software necesita para ejecutarse, incluidas bibliotecas, herramientas del sistema, código y tiempo de ejecución."
        },
        "k8s": {
            "title": "Kubernetes",
            "content": "Kubernetes (K8s) es un sistema de código abierto para automatizar el despliegue, escalado y gestión de aplicaciones en contenedores."
        },
        "terminal": {
            "title": "Terminal Interactiva",
            "desc": "Prueba algunos comandos comunes directamente en el navegador.",
            "welcome": "Bienvenido al Laboratorio de Contenedores Interactivo.",
            "hint": "Intenta ejecutar \"docker ps\" o \"kubectl get pods\". Escribe \"help\" para más."
        },
        "concepts": {
            "title": "Conceptos Clave",
            "images": {
                "title": "Imágenes",
                "content": "Una plantilla de solo lectura con instrucciones para crear un contenedor Docker."
            },
            "pods": {
                "title": "Pods",
                "content": "Las unidades de computación desplegables más pequeñas que se pueden crear y gestionar en Kubernetes."
            },
            "services": {
                "title": "Servicios",
                "content": "Una forma abstracta de exponer una aplicación que se ejecuta en un conjunto de Pods como un servicio de red."
            }
        },
        "deepDive": {
            "title": "Profundización",
            "dockerfile": {
                "title": "Dockerfile",
                "content": "Un documento de texto que contiene todos los comandos que un usuario podría llamar en la línea de comandos para ensamblar una imagen."
            },
            "compose": {
                "title": "Docker Compose",
                "content": "Una herramienta para definir y ejecutar aplicaciones Docker multicontenedor."
            },
            "architecture": {
                "title": "Arquitectura K8s",
                "content": "El Nodo Maestro (Plano de Control) gestiona los Nodos Trabajadores donde se ejecutan los Pods."
            }
        }
    },
    "databases": {
        "title": "Bases de Datos",
        "subtitle": "SQL vs NoSQL: Eligiendo la herramienta adecuada para el trabajo.",
        "postgres": {
            "title": "PostgreSQL (SQL)",
            "content": "Un potente sistema de base de datos relacional de objetos de código abierto con más de 30 años de desarrollo activo."
        },
        "mongo": {
            "title": "MongoDB (NoSQL)",
            "content": "Un programa de base de datos orientado a documentos multiplataforma disponible en código fuente. Clasificado como un programa de base de datos NoSQL, MongoDB utiliza documentos tipo JSON."
        },
        "sqlExample": {
            "title": "Ejemplo SQL",
            "desc": "Definiendo un esquema e insertando datos en PostgreSQL."
        },
        "mongoExample": {
            "title": "Ejemplo NoSQL",
            "desc": "Insertando un documento en MongoDB."
        },
        "comparison": {
            "title": "Comparación",
            "sql": {
                "title": "Relacional (SQL)",
                "structure": "Datos estructurados",
                "schema": "Esquema estricto",
                "scaling": "Escalado vertical"
            },
            "nosql": {
                "title": "No Relacional (NoSQL)",
                "structure": "Datos no estructurados",
                "schema": "Esquema flexible",
                "scaling": "Escalado horizontal"
            }
        },
        "deepDive": {
            "title": "Profundización",
            "acid": {
                "title": "Propiedades ACID",
                "content": "Atomicidad, Consistencia, Aislamiento, Durabilidad. Garantiza la validez de las transacciones de la base de datos."
            },
            "cap": {
                "title": "Teorema CAP",
                "content": "Consistencia, Disponibilidad, Tolerancia a Particiones. Un almacén de datos distribuido solo puede proporcionar dos de las tres garantías."
            },
            "indexing": {
                "title": "Indexación",
                "content": "Una técnica de estructura de datos utilizada para localizar y acceder rápidamente a los datos en una base de datos."
            }
        },
        "sqlCard": {
            "desc": "Bases de datos relacionales basadas en tablas estructuradas y esquemas estrictos. Ideal para relaciones complejas e integridad transaccional.",
            "features": {
                "acid": "Cumplimiento ACID",
                "scaling": "Escalado Vertical",
                "joins": "Joins Complejos"
            }
        },
        "nosqlCard": {
            "desc": "Bases de datos no relacionales con esquemas flexibles. Diseñadas para alto rendimiento, escala masiva y desarrollo rápido.",
            "features": {
                "scaling": "Escalado Horizontal",
                "flexible": "Esquema Flexible",
                "ha": "Alta Disponibilidad"
            }
        },
        "interactive": {
            "title": "Patio de Recreo de Bases de Datos",
            "desc": "Explora conceptos de bases de datos. Prueba \"help\" para ver los comandos disponibles.",
            "commands": {
                "sqlInfo": "Obtener información sobre bases de datos SQL",
                "nosqlInfo": "Obtener información sobre bases de datos NoSQL",
                "listTypes": "Listar tipos comunes de bases de datos",
                "help": "Mostrar ayuda"
            }
        },
        "comparisonDetails": {
            "structure": {
                "title": "Estructura",
                "sql": "Tablas con filas y columnas.",
                "nosql": "Documentos, clave-valor, grafos o columnas anchas."
            },
            "schema": {
                "title": "Esquema",
                "sql": "Rígido. Debe definirse antes de insertar datos.",
                "nosql": "Dinámico. Puede cambiar en cualquier momento."
            },
            "scalability": {
                "title": "Escalabilidad",
                "sql": "Vertical (máquina más grande).",
                "nosql": "Horizontal (más máquinas)."
            }
        }
    },
    "fedora": {
        "title": "Fedora Workstation",
        "subtitle": "La plataforma de desarrollo de código abierto de primer nivel.",
        "why": {
            "title": "¿Por qué Fedora?",
            "content": "Fedora Workstation es un sistema operativo pulido, fácil de usar y completo para portátiles y escritorios, con un conjunto completo de herramientas para desarrolladores y creadores de todo tipo."
        },
        "features": {
            "upstream": {
                "title": "Upstream Primero",
                "content": "Fedora contribuye directamente a los proyectos upstream. Obtienes las últimas características primero."
            },
            "technologies": {
                "title": "Vanguardia",
                "content": "Primero en adoptar nuevas tecnologías como Wayland, PipeWire y Btrfs por defecto."
            },
            "containers": {
                "title": "Listo para Contenedores",
                "content": "Soporte de primera clase para Podman, Buildah y Skopeo desde el primer momento."
            }
        },
        "setup": {
            "title": "Configuración de Desarrollador",
            "desc": "Comandos esenciales para preparar tu entorno."
        },
        "deepDive": {
            "title": "Profundización",
            "systemd": {
                "title": "Systemd",
                "content": "Un conjunto de bloques de construcción básicos para un sistema Linux. Proporciona un administrador de sistemas y servicios que se ejecuta como PID 1 e inicia el resto del sistema."
            },
            "firewall": {
                "title": "Firewalld",
                "content": "Una herramienta de gestión de cortafuegos que proporciona un cortafuegos gestionado dinámicamente con soporte para zonas de red/cortafuegos."
            },
            "toolbox": {
                "title": "Toolbox",
                "content": "Ofrece un entorno familiar basado en paquetes para desarrollar y depurar software que se ejecuta totalmente sin privilegios utilizando Podman."
            }
        }
    },
    "common": {
        "loading": "Cargando...",
        "copy": "Copiar código",
        "copied": "¡Copiado!"
    },
    "docker": {
        "title": "Docker",
        "subtitle": "Dominio de la Contenedorización",
        "description": "La guía completa para contenedorización, desde conceptos básicos hasta orquestación de nivel de producción."
    },
    "kubernetes": {
        "title": "Kubernetes",
        "subtitle": "Orquestación",
        "description": "Escala, gestiona y automatiza tus aplicaciones contenedorizadas con el orquestador estándar de la industria."
    },
    "git": {
        "title": "Git",
        "subtitle": "Control de Versiones",
        "description": "Domina el control de versiones distribuido con Git - el estándar de la industria para rastrear cambios de código y colaborar con equipos."
    },
    "github": {
        "title": "GitHub",
        "subtitle": "Colaboración",
        "description": "La plataforma líder mundial para control de versiones y colaboración. Construye, envía y mantén software con millones de desarrolladores."
    }
}